content/posts/2018-05-21-construction-finished.en.md
+++
title = "Construction Finished"
draft = false
date = 2018-05-21
slug = "construction-finished"
latex = true
+++

After eight months, my blog have finally reached a place where I feel comfortable taking down the "under heavy construction" notice on my home page. In stead of out right deleting the site road map though, I'm stashing it into a blog post.


## Site Road Map {#site-road-map}

-   ☑ ~~Find new hosting location.~~ Currently using DigitalOcean.
-   ☑ Install Arch Linux on server.
-   ☑ ~~Search for WP replacement.~~ Hugo is pretty good.
-   ☑ ~~Find a suitable theme.~~ Currently using `hugo-xmin` , may consider forking it and write my own ( `soresu` ).
-   ☑ Server side config, like `post-receive` for git auto deploy.
-   ☑ Language switcher that does more than redirecting to home page.
-   ☑ Enable Disqus.
-   ☑ Support \\(\LaTeX\\) expressions via ~~MathJax~~ KaTeX.
-   ☑ Copy-paste fixed page contents from old site (and translate them).
-   ☑ Enable https.
-   ☑ Backup old WP site.
-   ☑ Transfer domain to Google Domains and ensure DNS works as intended.
-   ☑ Find out how to write with `org-mode` or R markdown.
-   ☑ Configure multilingual support, including footer text, title, etc.
-   ☑ Find out how to make `emacs` work with `fcitx` .
-   ☑ Use ~~Google's Noto Sans font~~ Oxygen Sans and ~~Source Code Pro~~ Iosevka for code.
-   ☑ Find a suitable icon/favicon.
-   ☑ Improve templates for posts to display tags and categories.
-   ☑ Cosmetic changes, i.e. no underlines for hyperlinks.
-   ☑ Deal with some nuances in using `org-mode` with `hugo` , like how to get syntax highlighting to work properly.
-   ☑ Host my own email.
-   ☑ Customize `hugo new` to make it more useful, i.e. create multilingual versions directly.
-   ☑ Self-host commenting system as a replacement of Disqus.
-   ☑ Use Let's Encrypt's wildcard certificate.
-   ☑ Restore/rewrite and translate some of the more valuable old posts.


## What's on Home Page Now? {#what-s-on-home-page-now}

I already have an about page and a contact page for whatever I think people might be interested in knowing about myself, so I have no clue what I should put on home page. Since I found the old site road map to be a great way of reminding myself the stuffs I need to get done, I'll replace the road map with another to-do list: my goals for 2018. I am definitely not the most motivated kind of person, but seeing an unfinished to-do list every once in a while does get on my nerves. Let's see how well this is gonna work.
